#include <bits/stdc++.h>
#include "duduboiii.h"

using namespace std;

int main()
{
    string cmd, args;
cout << R"(

██████╗ ██╗   ██╗██████╗ ██╗   ██╗ ██████╗██╗     ██╗
██╔══██╗██║   ██║██╔══██╗██║   ██║██╔════╝██║     ██║
██║  ██║██║   ██║██║  ██║██║   ██║██║     ██║     ██║
██║  ██║██║   ██║██║  ██║██║   ██║██║     ██║     ██║
██████╔╝╚██████╔╝██████╔╝╚██████╔╝╚██████╗███████╗██║
╚═════╝  ╚═════╝ ╚═════╝  ╚═════╝  ╚═════╝╚══════╝╚═╝

)";

cout << "Welcome to DuduCLI v69.69\n";
cout << "Type -h or --help to see available commands.\n";
cout << "Type exit to quit.\n\n";

    while (true)
    {

        cout << "> ";

        cin >> cmd;

        getline(cin, args);

        if (args.length() > 0)
        {
            args.erase(0, 1);
        }

        shell(cmd, args);

        if (cmd == "exit")
        {
            break;
        }

    }

    return 0;
}